Revit 2024 API
BuiltInFailures.RoofFailures.OnlyUpwardFacesUsed Property
 The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OnlyUpwardFacesUsed { get; }
Visual Basic
Public Shared ReadOnly Property OnlyUpwardFacesUsed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OnlyUpwardFacesUsed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace